In [1]:
### 3번째 토피: 데이터 프레임 다루기-기초

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame(
        {"a" : [4 ,5, 6, 6],
        "b" : [7, 8, 9, 9],
        "c" : [10, 11, 12, 12]},
        index = [1, 2, 3, 4])

In [6]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [7]:
df2 = pd.DataFrame(
        [[4, 7, 10], [5, 8, 11], [6, 9, 12], [6, 9, 12]], 
        index=[1, 2, 3, 4], 
        columns=['a', 'b', 'c']) 
df2

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [8]:
df3 = df2.T
df3

    1   2   3   4
a   4   5   6   6
b   7   8   9   9
c  10  11  12  12

In [10]:
df3.columns = ['a', 'b', 'c', 'd']
df3

    a   b   c   d
a   4   5   6   6
b   7   8   9   9
c  10  11  12  12

In [11]:
df3.index = [11, 22, 33]
df3

     a   b   c   d
11   4   5   6   6
22   7   8   9   9
33  10  11  12  12

In [17]:
df3.rename(columns = {'a':'A', 'b':'B', 'c':'C', 'd':'D'})

     A   B   C   D
11   4   5   6   6
22   7   8   9   9
33  10  11  12  12

In [18]:
df3

     a   b   c   d
11   4   5   6   6
22   7   8   9   9
33  10  11  12  12

In [19]:
help(df3.rename)

Help on method rename in module pandas.core.frame:

rename(mapper=None, index=None, columns=None, axis=None, copy=True, inplace=False, level=None, errors='ignore') method of pandas.core.frame.DataFrame instance
    Alter axes labels.

    Function / dict values must be unique (1-to-1). Labels not contained in
    a dict / Series will be left as-is. Extra labels listed don't throw an
    error.

    See the :ref:`user guide <basics.rename>` for more.

    Parameters
    ----------
    mapper : dict-like or function
        Dict-like or function transformations to apply to
        that axis' values. Use either ``mapper`` and ``axis`` to
        specify the axis to target with ``mapper``, or ``index`` and
        ``columns``.
    index : dict-like or function
        Alternative to specifying axis (``mapper, axis=0``
        is equivalent to ``index=mapper``).
    columns : dict-like or function
        Alternative to specifying axis (``mapper, axis=1``
        is equivalent to ``columns=mapper``).
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Axis to target with ``mapper``. Can be either the axis name
        ('index', 'columns') or number (0, 1). The default is 'index'.
    copy : bool, default True
        Also copy underlying data.
    inplace : bool, default False
        Whether to return a new DataFrame. If True then value of copy is
        ignored.
    level : int or level name, default None
        In case of a MultiIndex, only rename labels in the specified
        level.
    errors : {'ignore', 'raise'}, default 'ignore'
        If 'raise', raise a `KeyError` when a dict-like `mapper`, `index`,
        or `columns` contains labels that are not present in the Index
        being transformed.
        If 'ignore', existing keys will be renamed and extra keys will be
        ignored.

    Returns
    -------
    DataFrame or None
        DataFrame with the renamed axis labels or None if ``inplace=True``.

    Raises
    ------
    KeyError
        If any of the labels is not found in the selected axis and
        "errors='raise'".

    See Also
    --------
    DataFrame.rename_axis : Set the name of the axis.

    Examples
    --------
    ``DataFrame.rename`` supports two calling conventions

    * ``(index=index_mapper, columns=columns_mapper, ...)``
    * ``(mapper, axis={'index', 'columns'}, ...)``

    We *highly* recommend using keyword arguments to clarify your
    intent.

    Rename columns using a mapping:

    >>> df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
    >>> df.rename(columns={"A": "a", "B": "c"})
       a  c
    0  1  4
    1  2  5
    2  3  6

    Rename index using a mapping:

    >>> df.rename(index={0: "x", 1: "y", 2: "z"})
       A  B
    x  1  4
    y  2  5
    z  3  6

    Cast index labels to a different type:

    >>> df.index
    RangeIndex(start=0, stop=3, step=1)
    >>> df.rename(index=str).index
    Index(['0', '1', '2'], dtype='object')

    >>> df.rename(columns={"A": "a", "B": "b", "C": "c"}, errors="raise")
    Traceback (most recent call last):
    KeyError: ['C'] not found in axis

    Using axis-style parameters:

    >>> df.rename(str.lower, axis='columns')
       a  b
    0  1  4
    1  2  5
    2  3  6

    >>> df.rename({1: 2, 2: 4}, axis='index')
       A  B
    0  1  4
    2  2  5
    4  3  6

In [27]:
df3.index

Int64Index([11, 22, 33], dtype='int64')

In [28]:
df44 = df3.rename(index={11:1, 22:2, 33:3})
df44

    a   b   c   d
1   4   5   6   6
2   7   8   9   9
3  10  11  12  12

In [29]:
df44.index

Int64Index([1, 2, 3], dtype='int64')

In [24]:
df3.rename(index={'11':1, '22':2, '33':3})

     a   b   c   d
11   4   5   6   6
22   7   8   9   9
33  10  11  12  12

In [25]:
df3.rename(index={'11':'1', '22':'2', '33':'3'})

     a   b   c   d
11   4   5   6   6
22   7   8   9   9
33  10  11  12  12

In [30]:
df444 = df3.rename(index={11:'1', 22:'2', 33:'3'})
df444.index

Index(['1', '2', '3'], dtype='object')

In [20]:
df33 = df3.rename(columns = {'a':'A', 'b':'B', 'c':'C', 'd':'D'})
df33

     A   B   C   D
11   4   5   6   6
22   7   8   9   9
33  10  11  12  12

### 비교연산자를 이용한 조회

In [31]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [20]:
df.b>7

1    False
2     True
3     True
4     True
Name: b, dtype: bool

In [21]:
df[df.b>7]

   a  b   c
2  5  8  11
3  6  9  12
4  6  9  12

In [22]:
df[df.c>7]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [23]:
df[df['c']>7]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

* 열 이름이 한글이나 특수문자 있는 경우 df['열이름']

In [24]:
df[df['c'] == 7]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [25]:
df[df['c']>=7]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [26]:
df["b"] !=7

1    False
2     True
3     True
4     True
Name: b, dtype: bool

In [27]:
df[df["b"] !=7]

   a  b   c
2  5  8  11
3  6  9  12
4  6  9  12

* 큰 따옴표, 작은 따옴표 동일하게 인식

### 중복 행 제거하는 drop_duplicates( )

In [33]:
# 도움말 보기
df.drop_duplicates?
#df.drop_duplication(shift + Tab)
help(df.drop_duplicates)

Help on method drop_duplicates in module pandas.core.frame:

drop_duplicates(subset: 'Optional[Union[Hashable, Sequence[Hashable]]]' = None, keep: 'Union[str, bool]' = 'first', inplace: 'bool' = False, ignore_index: 'bool' = False) -> 'Optional[DataFrame]' method of pandas.core.frame.DataFrame instance
    Return DataFrame with duplicate rows removed.

    Considering certain columns is optional. Indexes, including time indexes
    are ignored.

    Parameters
    ----------
    subset : column label or sequence of labels, optional
        Only consider certain columns for identifying duplicates, by
        default use all of the columns.
    keep : {'first', 'last', False}, default 'first'
        Determines which duplicates (if any) to keep.
        - ``first`` : Drop duplicates except for the first occurrence.
        - ``last`` : Drop duplicates except for the last occurrence.
        - False : Drop all duplicates.
    inplace : bool, default False
        Whether to drop duplicates in place or to return a copy.
    ignore_index : bool, default False
        If True, the resulting axis will be labeled 0, 1, …, n - 1.

        .. versionadded:: 1.0.0

    Returns
    -------
    DataFrame or None
        DataFrame with duplicates removed or None if ``inplace=True``.

    See Also
    --------
    DataFrame.value_counts: Count unique combinations of columns.

    Examples
    --------
    Consider dataset containing ramen rating.

    >>> df = pd.DataFrame({
    ...     'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    ...     'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    ...     'rating': [4, 4, 3.5, 15, 5]
    ... })
    >>> df
        brand style  rating
    0  Yum Yum   cup     4.0
    1  Yum Yum   cup     4.0
    2  Indomie   cup     3.5
    3  Indomie  pack    15.0
    4  Indomie  pack     5.0

    By default, it removes duplicate rows based on all columns.

    >>> df.drop_duplicates()
        brand style  rating
    0  Yum Yum   cup     4.0
    2  Indomie   cup     3.5
    3  Indomie  pack    15.0
    4  Indomie  pack     5.0

    To remove duplicates on specific column(s), use ``subset``.

    >>> df.drop_duplicates(subset=['brand'])
        brand style  rating
    0  Yum Yum   cup     4.0
    2  Indomie   cup     3.5

    To remove duplicates and keep last occurrences, use ``keep``.

    >>> df.drop_duplicates(subset=['brand', 'style'], keep='last')
        brand style  rating
    1  Yum Yum   cup     4.0
    2  Indomie   cup     3.5
    4  Indomie  pack     5.0

In [34]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [35]:
df.drop_duplicates()

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [37]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

* 변수에 담지 않아서 중복 행 제거한 결과가 원본 df에 반영 안됨

In [30]:
df.drop_duplicates()

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [31]:
# df.drop_duplicates?

In [38]:
df.drop_duplicates(inplace = True)
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

* inplace = True 옵션은 원본에 바로 적용시키라는 뜻의 옵션
* Pandas에서는 drop_duplicates(inplace = True)를 비추함
* 대신 df = df.drop_duplicates() 이런 형식을 권장

In [39]:
df = df2

In [40]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [41]:
df.drop_duplicates(keep='first')

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [42]:
df.drop_duplicates(keep='last')

   a  b   c
1  4  7  10
2  5  8  11
4  6  9  12

In [37]:
df = df.drop_duplicates(keep='first')
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [38]:
df = df.drop_duplicates(keep='last')
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

### 특정값, null값 조회
#### 특정값을 조회하는 isin( )

In [ ]:
# aa라는 변수에 3이라는 값 있나?
aa.isin([3])

In [59]:
# aa라는 변수의 xyz컬럼에 3이라는 값 있나?
aa['xyz'].isin([3])

NameError: name 'aa' is not defined

In [ ]:
# cc라는 변수의 'abc'라는 컬럼에 빈 값 있나? (있는지의 유무만..)
cc['abc'].isnull(), ~cc['abc'].notnull()

In [ ]:
# df.column.isin(values) 
# df.a.isin?
help(df.a.isin)

In [44]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [46]:
df.a.isin(5)

TypeError: only list-like objects are allowed to be passed to isin(), you passed a [int]

* 특정값이 있나 확인하는 isin, 특정값은 리스트 형태로 써야 함

In [41]:
df.a.isin([5])

1    False
2     True
3    False
Name: a, dtype: bool

In [42]:
df[df.a.isin([5])]

   a  b   c
2  5  8  11

In [43]:
df.a.isin([5, 6])

1    False
2     True
3     True
Name: a, dtype: bool

In [44]:
df['a'].isin([5, 6])

1    False
2     True
3     True
Name: a, dtype: bool

* 주의! 열의 이름이 한글, 특수문자 등이 있다면 반드시 ['열이름'] 형태로 기입해야 함

#### null값 조회하는 isnull( )

In [ ]:
df.isnull( )

In [45]:
pd.isnull(df)

       a      b      c
1  False  False  False
2  False  False  False
3  False  False  False

In [ ]:
df4 = pd.DataFrame(
        {"a" : [4 ,5, 6, 6],
        "b" : [7, 8, 9 ,9],
        "c" : [10, 11, 12, 12]},
        index = [1, 2, 3, 4, 5])
df4
# data 중간 중간에 빈 갑 넣고 싶을 떄
df4 = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, NaN],
        "b" : [7, 8, NaN, 9 ,9],
        "c" : [10, 11, 12, NaN, 12]},
        index = [1, 2, 3, 4, 5])
df4

In [47]:
import numpy as np
df4 = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8, np.nan, 9, 9],
        "c" : [10, 11, 12, np.nan, 12]},
        index = [1, 2, 3, 4, 5])
df4

     a    b     c
1  4.0  7.0  10.0
2  5.0  8.0  11.0
3  6.0  NaN  12.0
4  6.0  9.0   NaN
5  NaN  9.0  12.0

In [48]:
df4 = pd.DataFrame(
        {"a" : [4 ,5, 6, 6, np.nan],
        "b" : [7, 8, np.nan, 9, 9],
        "c" : [10, 11, 12, np.nan, 12]},
        index = [1, 2, 3, 4, 5], dtype = int)
df4

     a    b    c
1    4    7   10
2    5    8   11
3    6  NaN   12
4    6    9  NaN
5  NaN    9   12

In [48]:
df.dtypes

a    int64
b    int64
c    int64
dtype: object

In [49]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [50]:
pd.isnull(df4)

       a      b      c
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False   True
5   True  False  False

In [51]:
df4.isnull()

       a      b      c
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False   True
5   True  False  False

In [54]:
df4['a'].isnull()

1    False
2    False
3    False
4    False
5     True
Name: a, dtype: bool

In [53]:
df4['a'].isnull().sum()

1

###### True는 1, False는 0으로 인식하는 성질을 이용해
###### df4의 a열에 isnull()을 하면 빈 값 있는 셀을 True라고 알려줌
###### True는 1로 인식, 즉 True의 개수만큼 1이 있다고 볼 수 있음
###### True의 총 개수(즉, 빈 값의 개수)를 구하려면 1들을 더한 결과로 구할 수 있음
* 'a'열의 null값 즉, 비여있는 값 이 총 몇개인지 알려줌

* 'a'열의 null값 즉, 비어있는값 이 총 몇 개인지 알려줌

In [50]:
df4['a']

1      4
2      5
3      6
4      6
5    NaN
Name: a, dtype: object

In [51]:
df4['a'].sum()

21

In [52]:
True + True

2

In [53]:
1 + 1

2

#### notnull과 ~notnull

In [54]:
pd.notnull(df4)

       a      b      c
1   True   True   True
2   True   True   True
3   True  False   True
4   True   True  False
5  False   True   True

In [ ]:
df4.notnull()

In [55]:
df4.notnull().sum()

a    4
b    4
c    4
dtype: int64

* notnull의 총 개수를 알려 줌

In [56]:
df4.a.notnull()

1     True
2     True
3     True
4     True
5    False
Name: a, dtype: bool

In [57]:
df4['a'].notnull()

1     True
2     True
3     True
4     True
5    False
Name: a, dtype: bool

In [58]:
~df4.a.notnull()

1    False
2    False
3    False
4    False
5     True
Name: a, dtype: bool

### 논리 연산자를 이용한 조회

In [ ]:
True and False

In [ ]:
True or False

In [55]:
df4

     a    b    c
1    4    7   10
2    5    8   11
3    6  NaN   12
4    6    9  NaN
5  NaN    9   12

In [57]:
#df4[df4.b == 7] & df4[df4.a == 4]
df4[(df4.b == 7) & (df4.a == 4)]

   a  b   c
1  4  7  10

In [58]:
#df4[df4.b == 7] | df4[df4.a == 4]
df4[(df4.b == 7) | (df4.a == 4)]

   a  b   c
1  4  7  10

In [ ]:
df4[df4.b == 9] | df4[df4.a == 6]

In [64]:
df4[df4.b == 9]

     a  b    c
4    6  9  NaN
5  NaN  9   12

In [65]:
df4[df4.a == 6]

   a    b    c
3  6  NaN   12
4  6    9  NaN

In [ ]:
df4[(df4.b == 9) & (df4.a == 6)]

In [ ]:
df4[(df4.b == 9) | (df4.a == 6)]

#### 기초적 통계 관련

In [60]:
df4.nlargest?

In [61]:
help(df4.nlargest)

Help on method nlargest in module pandas.core.frame:

nlargest(n, columns, keep='first') -> 'DataFrame' method of pandas.core.frame.DataFrame instance
    Return the first `n` rows ordered by `columns` in descending order.

    Return the first `n` rows with the largest values in `columns`, in
    descending order. The columns that are not specified are returned as
    well, but not used for ordering.

    This method is equivalent to
    ``df.sort_values(columns, ascending=False).head(n)``, but more
    performant.

    Parameters
    ----------
    n : int
        Number of rows to return.
    columns : label or list of labels
        Column label(s) to order by.
    keep : {'first', 'last', 'all'}, default 'first'
        Where there are duplicate values:

        - `first` : prioritize the first occurrence(s)
        - `last` : prioritize the last occurrence(s)
        - ``all`` : do not drop any duplicates, even it means
                    selecting more than `n` items.

        .. versionadded:: 0.24.0

    Returns
    -------
    DataFrame
        The first `n` rows ordered by the given columns in descending
        order.

    See Also
    --------
    DataFrame.nsmallest : Return the first `n` rows ordered by `columns` in
        ascending order.
    DataFrame.sort_values : Sort DataFrame by the values.
    DataFrame.head : Return the first `n` rows without re-ordering.

    Notes
    -----
    This function cannot be used with all column types. For example, when
    specifying columns with `object` or `category` dtypes, ``TypeError`` is
    raised.

    Examples
    --------
    >>> df = pd.DataFrame({'population': [59000000, 65000000, 434000,
    ...                                   434000, 434000, 337000, 11300,
    ...                                   11300, 11300],
    ...                    'GDP': [1937894, 2583560 , 12011, 4520, 12128,
    ...                            17036, 182, 38, 311],
    ...                    'alpha-2': ["IT", "FR", "MT", "MV", "BN",
    ...                                "IS", "NR", "TV", "AI"]},
    ...                   index=["Italy", "France", "Malta",
    ...                          "Maldives", "Brunei", "Iceland",
    ...                          "Nauru", "Tuvalu", "Anguilla"])
    >>> df
              population      GDP alpha-2
    Italy       59000000  1937894      IT
    France      65000000  2583560      FR
    Malta         434000    12011      MT
    Maldives      434000     4520      MV
    Brunei        434000    12128      BN
    Iceland       337000    17036      IS
    Nauru          11300      182      NR
    Tuvalu         11300       38      TV
    Anguilla       11300      311      AI

    In the following example, we will use ``nlargest`` to select the three
    rows having the largest values in column "population".

    >>> df.nlargest(3, 'population')
            population      GDP alpha-2
    France    65000000  2583560      FR
    Italy     59000000  1937894      IT
    Malta       434000    12011      MT

    When using ``keep='last'``, ties are resolved in reverse order:

    >>> df.nlargest(3, 'population', keep='last')
            population      GDP alpha-2
    France    65000000  2583560      FR
    Italy     59000000  1937894      IT
    Brunei      434000    12128      BN

    When using ``keep='all'``, all duplicate items are maintained:

    >>> df.nlargest(3, 'population', keep='all')
              population      GDP alpha-2
    France      65000000  2583560      FR
    Italy       59000000  1937894      IT
    Malta         434000    12011      MT
    Maldives      434000     4520      MV
    Brunei        434000    12128      BN

    To order by the largest values in column "population" and then "GDP",
    we can specify multiple columns like in the next example.

    >>> df.nlargest(3, ['population', 'GDP'])
            population      GDP alpha-2
    France    65000000  2583560      FR
    Italy     59000000  1937894      IT
    Brunei      434000    12128      BN

In [71]:
import pandas as pd

In [62]:
df5 = pd.DataFrame({'population': [59000000, 65000000, 434000,
                                   434000, 434000, 337000, 11300,
                                   11300, 11300],
                    'GDP': [1937894, 2583560 , 12011, 4520, 12128,
                            17036, 182, 38, 311],
                    'alpha-2': ["IT", "FR", "MT", "MV", "BN",
                                "IS", "NR", "TV", "AI"]},
                   index=["Italy", "France", "Malta",
                          "Maldives", "Brunei", "Iceland",
                          "Nauru", "Tuvalu", "Anguilla"])
df5

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [ ]:
df5.nlargest(3, 'population')

In [64]:
df5.nlargest(3, 'population', keep='all')

          population      GDP alpha-2
France      65000000  2583560      FR
Italy       59000000  1937894      IT
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN

In [65]:
df5.nsmallest(3, 'population')

          population  GDP alpha-2
Nauru          11300  182      NR
Tuvalu         11300   38      TV
Anguilla       11300  311      AI

In [66]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, Italy to Anguilla
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   population  9 non-null      int64
 1   GDP         9 non-null      int64
 2   alpha-2     9 non-null      object
dtypes: int64(2), object(1)
memory usage: 588.0+ bytes

In [ ]:
df5.describe()

In [ ]:
df5['population'].count()

In [ ]:
df5['population'].mean()

In [ ]:
df5['population'].median()

In [ ]:
df5['population'].max()

In [ ]:
df5['population'].min()

In [73]:
help(df5.sample)

Help on method sample in module pandas.core.generic:

sample(n=None, frac=None, replace=False, weights=None, random_state=None, axis=None) -> 'FrameOrSeries' method of pandas.core.frame.DataFrame instance
    Return a random sample of items from an axis of object.

    You can use `random_state` for reproducibility.

    Parameters
    ----------
    n : int, optional
        Number of items from axis to return. Cannot be used with `frac`.
        Default = 1 if `frac` = None.
    frac : float, optional
        Fraction of axis items to return. Cannot be used with `n`.
    replace : bool, default False
        Allow or disallow sampling of the same row more than once.
    weights : str or ndarray-like, optional
        Default 'None' results in equal probability weighting.
        If passed a Series, will align with target object on index. Index
        values in weights not found in sampled object will be ignored and
        index values in sampled object not in weights will be assigned
        weights of zero.
        If called on a DataFrame, will accept the name of a column
        when axis = 0.
        Unless weights are a Series, weights must be same length as axis
        being sampled.
        If weights do not sum to 1, they will be normalized to sum to 1.
        Missing values in the weights column will be treated as zero.
        Infinite values not allowed.
    random_state : int, array-like, BitGenerator, np.random.RandomState, optional
        If int, array-like, or BitGenerator (NumPy>=1.17), seed for
        random number generator
        If np.random.RandomState, use as numpy RandomState object.

        .. versionchanged:: 1.1.0

            array-like and BitGenerator (for NumPy>=1.17) object now passed to
            np.random.RandomState() as seed

    axis : {0 or ‘index’, 1 or ‘columns’, None}, default None
        Axis to sample. Accepts axis number or name. Default is stat axis
        for given data type (0 for Series and DataFrames).

    Returns
    -------
    Series or DataFrame
        A new object of same type as caller containing `n` items randomly
        sampled from the caller object.

    See Also
    --------
    DataFrameGroupBy.sample: Generates random samples from each group of a
        DataFrame object.
    SeriesGroupBy.sample: Generates random samples from each group of a
        Series object.
    numpy.random.choice: Generates a random sample from a given 1-D numpy
        array.

    Notes
    -----
    If `frac` > 1, `replacement` should be set to `True`.

    Examples
    --------
    >>> df = pd.DataFrame({'num_legs': [2, 4, 8, 0],
    ...                    'num_wings': [2, 0, 0, 0],
    ...                    'num_specimen_seen': [10, 2, 1, 8]},
    ...                   index=['falcon', 'dog', 'spider', 'fish'])
    >>> df
            num_legs  num_wings  num_specimen_seen
    falcon         2          2                 10
    dog            4          0                  2
    spider         8          0                  1
    fish           0          0                  8

    Extract 3 random elements from the ``Series`` ``df['num_legs']``:
    Note that we use `random_state` to ensure the reproducibility of
    the examples.

    >>> df['num_legs'].sample(n=3, random_state=1)
    fish      0
    spider    8
    falcon    2
    Name: num_legs, dtype: int64

    A random 50% sample of the ``DataFrame`` with replacement:

    >>> df.sample(frac=0.5, replace=True, random_state=1)
          num_legs  num_wings  num_specimen_seen
    dog          4          0                  2
    fish         0          0                  8

    An upsample sample of the ``DataFrame`` with replacement:
    Note that `replace` parameter has to be `True` for `frac` parameter > 1.

    >>> df.sample(frac=2, replace=True, random_state=1)
            num_legs  num_wings  num_specimen_seen
    dog            4          0                  2
    fish           0          0                  8
    falcon         2          2                 10
    falcon         2          2                 10
    fish           0          0                  8
    dog            4          0                  2
    fish           0          0                  8
    dog            4          0                  2

    Using a DataFrame column as weights. Rows with larger value in the
    `num_specimen_seen` column are more likely to be sampled.

    >>> df.sample(n=2, weights='num_specimen_seen', random_state=1)
            num_legs  num_wings  num_specimen_seen
    falcon         2          2                 10
    fish           0          0                  8

In [74]:
df5

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [75]:
df5.sample(n=5)

        population      GDP alpha-2
Brunei      434000    12128      BN
Tuvalu       11300       38      TV
Italy     59000000  1937894      IT
France    65000000  2583560      FR
Malta       434000    12011      MT

In [86]:
df5.sample(frac=1)

          population      GDP alpha-2
Italy       59000000  1937894      IT
Tuvalu         11300       38      TV
France      65000000  2583560      FR
Brunei        434000    12128      BN
Malta         434000    12011      MT
Iceland       337000    17036      IS
Anguilla       11300      311      AI
Nauru          11300      182      NR
Maldives      434000     4520      MV

In [37]:
df5['population'] > df5['population'].mean()

Italy        True
France       True
Malta       False
Maldives    False
Brunei      False
Iceland     False
Nauru       False
Tuvalu      False
Anguilla    False
Name: population, dtype: bool

In [38]:
df5[df5['population'] > df5['population'].mean()]

        population      GDP alpha-2
Italy     59000000  1937894      IT
France    65000000  2583560      FR

### 불린기반 조회, 열 연산, 브로드캐스팅, 인덱스기준 정렬

In [39]:
df5.loc[[True, False, False, False, True, True, False, True, True]]

          population      GDP alpha-2
Italy       59000000  1937894      IT
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [76]:
df5['population'] - df5['GDP']

Italy       57062106
France      62416440
Malta         421989
Maldives      429480
Brunei        421872
Iceland       319964
Nauru          11118
Tuvalu         11262
Anguilla       10989
dtype: int64

In [77]:
df5

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [78]:
df5['pop-GDP'] = df5['population'] - df5['GDP']
df5

          population      GDP alpha-2   pop-GDP
Italy       59000000  1937894      IT  57062106
France      65000000  2583560      FR  62416440
Malta         434000    12011      MT    421989
Maldives      434000     4520      MV    429480
Brunei        434000    12128      BN    421872
Iceland       337000    17036      IS    319964
Nauru          11300      182      NR     11118
Tuvalu         11300       38      TV     11262
Anguilla       11300      311      AI     10989

In [79]:
aa = df5['population'] - df5['GDP']
df5['aa2'] = aa
df5

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [43]:
df5['population']

Italy       59000000
France      65000000
Malta         434000
Maldives      434000
Brunei        434000
Iceland       337000
Nauru          11300
Tuvalu         11300
Anguilla       11300
Name: population, dtype: int64

In [44]:
df5['population']//1000

Italy       59000
France      65000
Malta         434
Maldives      434
Brunei        434
Iceland       337
Nauru          11
Tuvalu         11
Anguilla       11
Name: population, dtype: int64

* 위와 같이 일률적으로 수식을 적용하는 것을 "브로드캐스팅"이라고 지칭

In [80]:
df5

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [46]:
df5 * 3

          population      GDP alpha-2    pop-GDP        aa2
Italy      177000000  5813682  ITITIT  171186318  171186318
France     195000000  7750680  FRFRFR  187249320  187249320
Malta        1302000    36033  MTMTMT    1265967    1265967
Maldives     1302000    13560  MVMVMV    1288440    1288440
Brunei       1302000    36384  BNBNBN    1265616    1265616
Iceland      1011000    51108  ISISIS     959892     959892
Nauru          33900      546  NRNRNR      33354      33354
Tuvalu         33900      114  TVTVTV      33786      33786
Anguilla       33900      933  AIAIAI      32967      32967

In [95]:
df5

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [48]:
df5.sort_index(ascending = True)

          population      GDP alpha-2   pop-GDP       aa2
Anguilla       11300      311      AI     10989     10989
Brunei        434000    12128      BN    421872    421872
France      65000000  2583560      FR  62416440  62416440
Iceland       337000    17036      IS    319964    319964
Italy       59000000  1937894      IT  57062106  57062106
Maldives      434000     4520      MV    429480    429480
Malta         434000    12011      MT    421989    421989
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262

In [49]:
df6 = df5.sort_index(ascending = True)

In [50]:
df5['GDP']

Italy       1937894
France      2583560
Malta         12011
Maldives       4520
Brunei        12128
Iceland       17036
Nauru           182
Tuvalu           38
Anguilla        311
Name: GDP, dtype: int64

In [51]:
df6['GDP']

Anguilla        311
Brunei        12128
France      2583560
Iceland       17036
Italy       1937894
Maldives       4520
Malta         12011
Nauru           182
Tuvalu           38
Name: GDP, dtype: int64

In [52]:
df5['GDP'] + df6['GDP']

Anguilla        622
Brunei        24256
France      5167120
Iceland       34072
Italy       3875788
Maldives       9040
Malta         24022
Nauru           364
Tuvalu           76
Name: GDP, dtype: int64

In [53]:
df5['GDP']*2

Italy       3875788
France      5167120
Malta         24022
Maldives       9040
Brunei        24256
Iceland       34072
Nauru           364
Tuvalu           76
Anguilla        622
Name: GDP, dtype: int64

### 변수명.drop

In [81]:
help(df5.drop)

Help on method drop in module pandas.core.frame:

drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise') method of pandas.core.frame.DataFrame instance
    Drop specified labels from rows or columns.

    Remove rows or columns by specifying label names and corresponding
    axis, or by specifying directly index or column names. When using a
    multi-index, labels on different levels can be removed by specifying
    the level.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop.
    axis : {0 or 'index', 1 or 'columns'}, default 0
        Whether to drop labels from the index (0 or 'index') or
        columns (1 or 'columns').
    index : single label or list-like
        Alternative to specifying axis (``labels, axis=0``
        is equivalent to ``index=labels``).
    columns : single label or list-like
        Alternative to specifying axis (``labels, axis=1``
        is equivalent to ``columns=labels``).
    level : int or level name, optional
        For MultiIndex, level from which the labels will be removed.
    inplace : bool, default False
        If False, return a copy. Otherwise, do operation
        inplace and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and only existing labels are
        dropped.

    Returns
    -------
    DataFrame or None
        DataFrame without the removed index or column labels or
        None if ``inplace=True``.

    Raises
    ------
    KeyError
        If any of the labels is not found in the selected axis.

    See Also
    --------
    DataFrame.loc : Label-location based indexer for selection by label.
    DataFrame.dropna : Return DataFrame with labels on given axis omitted
        where (all or any) data are missing.
    DataFrame.drop_duplicates : Return DataFrame with duplicate rows
        removed, optionally only considering certain columns.
    Series.drop : Return Series with specified index labels removed.

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3, 4),
    ...                   columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Drop columns and/or rows of MultiIndex DataFrame

    >>> midx = pd.MultiIndex(levels=[['lama', 'cow', 'falcon'],
    ...                              ['speed', 'weight', 'length']],
    ...                      codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2],
    ...                             [0, 1, 2, 0, 1, 2, 0, 1, 2]])
    >>> df = pd.DataFrame(index=midx, columns=['big', 'small'],
    ...                   data=[[45, 30], [200, 100], [1.5, 1], [30, 20],
    ...                         [250, 150], [1.5, 0.8], [320, 250],
    ...                         [1, 0.8], [0.3, 0.2]])
    >>> df
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
            length  1.5     1.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
            length  1.5     0.8
    falcon  speed   320.0   250.0
            weight  1.0     0.8
            length  0.3     0.2

    >>> df.drop(index='cow', columns='small')
                    big
    lama    speed   45.0
            weight  200.0
            length  1.5
    falcon  speed   320.0
            weight  1.0
            length  0.3

    >>> df.drop(index='length', level=1)
                    big     small
    lama    speed   45.0    30.0
            weight  200.0   100.0
    cow     speed   30.0    20.0
            weight  250.0   150.0
    falcon  speed   320.0   250.0
            weight  1.0     0.8

In [1]:
df5.drop?

Object `df5.drop` not found.

In [88]:
import numpy as np
df = pd.DataFrame(np.arange(12).reshape(3,4),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [58]:
df.drop(columns=['B', 'C'])

   A   D
0  0   3
1  4   7
2  8  11

In [60]:
df.drop(['B', 'C'], axis=1)

   A   D
0  0   3
1  4   7
2  8  11

In [85]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [62]:
df.drop([0, 1])

   A  B   C   D
2  8  9  10  11

In [86]:
df6 = df5.copy()
df6

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [87]:
df7 = df5
df7

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [92]:
df5['GDP*2']=df5['GDP']*2

In [93]:
df5

          population      GDP alpha-2   pop-GDP       aa2    GDP*2
Italy       59000000  1937894      IT  57062106  57062106  3875788
France      65000000  2583560      FR  62416440  62416440  5167120
Malta         434000    12011      MT    421989    421989    24022
Maldives      434000     4520      MV    429480    429480     9040
Brunei        434000    12128      BN    421872    421872    24256
Iceland       337000    17036      IS    319964    319964    34072
Nauru          11300      182      NR     11118     11118      364
Tuvalu         11300       38      TV     11262     11262       76
Anguilla       11300      311      AI     10989     10989      622

In [94]:
df6

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [95]:
df7

          population      GDP alpha-2   pop-GDP       aa2    GDP*2
Italy       59000000  1937894      IT  57062106  57062106  3875788
France      65000000  2583560      FR  62416440  62416440  5167120
Malta         434000    12011      MT    421989    421989    24022
Maldives      434000     4520      MV    429480    429480     9040
Brunei        434000    12128      BN    421872    421872    24256
Iceland       337000    17036      IS    319964    319964    34072
Nauru          11300      182      NR     11118     11118      364
Tuvalu         11300       38      TV     11262     11262       76
Anguilla       11300      311      AI     10989     10989      622

In [101]:
df5 = df5.drop(['population'], axis=1)

In [100]:
df5

          population      GDP alpha-2   pop-GDP       aa2    GDP*2
Italy       59000000  1937894      IT  57062106  57062106  3875788
France      65000000  2583560      FR  62416440  62416440  5167120
Malta         434000    12011      MT    421989    421989    24022
Maldives      434000     4520      MV    429480    429480     9040
Brunei        434000    12128      BN    421872    421872    24256
Iceland       337000    17036      IS    319964    319964    34072
Nauru          11300      182      NR     11118     11118      364
Tuvalu         11300       38      TV     11262     11262       76
Anguilla       11300      311      AI     10989     10989      622

In [ ]:
df7.drop(columns = ['pop-GDP'])

In [68]:
df5=df7.drop(['pop-GDP'], axis=1)
df5

          population      GDP alpha-2       aa2
Italy       59000000  1937894      IT  57062106
France      65000000  2583560      FR  62416440
Malta         434000    12011      MT    421989
Maldives      434000     4520      MV    429480
Brunei        434000    12128      BN    421872
Iceland       337000    17036      IS    319964
Nauru          11300      182      NR     11118
Tuvalu         11300       38      TV     11262
Anguilla       11300      311      AI     10989

* df7.drop(['pop-GDP'])는 에러 남(인덱스에 'pop-GDP'가 없어서)

In [101]:
df5 = df7.drop(['aa2'], axis = 1)
df5

          population      GDP alpha-2   pop-GDP
Italy       59000000  1937894      IT  57062106
France      65000000  2583560      FR  62416440
Malta         434000    12011      MT    421989
Maldives      434000     4520      MV    429480
Brunei        434000    12128      BN    421872
Iceland       337000    17036      IS    319964
Nauru          11300      182      NR     11118
Tuvalu         11300       38      TV     11262
Anguilla       11300      311      AI     10989

In [71]:
df7

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Iceland       337000    17036      IS    319964    319964
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

#### "Iceland"를 삭제하려면
* df7.drop(["Iceland"])
* df7.drop(index = "Iceland")
* df7.drop(["Iceland"], axis = 0)
* df7.drop("Iceland", axis = 0)
* 모두 가능
* * 행방향 이니까 index = 또는 axis = 0 또는 생략가능
* * 단일행이라서 [대괄호]로 감싸도 되고 안해도 되고)

In [102]:
df7.drop(["Iceland"])

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [103]:
df7.drop(index = "Iceland")

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [104]:
df7.drop(["Iceland"], axis = 0)

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [105]:
df7.drop("Iceland", axis = 0)

          population      GDP alpha-2   pop-GDP       aa2
Italy       59000000  1937894      IT  57062106  57062106
France      65000000  2583560      FR  62416440  62416440
Malta         434000    12011      MT    421989    421989
Maldives      434000     4520      MV    429480    429480
Brunei        434000    12128      BN    421872    421872
Nauru          11300      182      NR     11118     11118
Tuvalu         11300       38      TV     11262     11262
Anguilla       11300      311      AI     10989     10989

In [17]:
df7.drop(['Italy', 'Malta'])

          population      GDP alpha-2
France      65000000  2583560      FR
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

* 변수a가 있고, 이 변수a의  데이터프레임을 받는 변수 b와 c가 있다고 하자
* b = a.copy()
* c = a
* b는 a.copy()한 시점의 데이터프레임을 받아 별도로 관리(개별 변수처럼 움직임)
* c는 c=a한 시점 이후에 a가 바뀌면 덩달아 바뀔 수 있음
* a의 원본데이터가 바로 바뀌는 코드 적용 시 c도 덩달아 바뀜
* a의 원본데이터가 바로 안 바뀌는 코드의 경우 c는 영향 안받음
* 예1) a = a.drop(~~~)하면 c는 안 바뀜
* 예2)     a.drop(~~, inplace=True)하면 c도 바뀜

### 시리즈의 연산

In [19]:
age = pd.Series([37, 61, 90, 66, 56, 45, 41, 77])
age

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
dtype: int64

In [20]:
age + age

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
dtype: int64

In [21]:
age.max()

90

In [22]:
age.mean()

59.125

In [23]:
age > age.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
dtype: bool

In [24]:
age[age > age.mean()]

1    61
2    90
3    66
7    77
dtype: int64

In [25]:
ex = pd.Series([1, 100])
ex

0      1
1    100
dtype: int64

In [76]:
age

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
dtype: int64

In [26]:
age + ex

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

* 나머지 인덱스인 2~7은 계산할 수 없어서 NaN으로 처리 함

In [ ]:
rev_age = age.sort_index(ascending = False)

In [ ]:
age + rev_age

In [ ]:
age * 2

In [ ]:
age.drop(0)

In [ ]:
age.drop([1, 3, 5])